In [1]:
import numpy as np
import pandas as pd

# TH1

In [2]:
df1 = pd.DataFrame({
    'hoten': ['nva', 'nvb', 'ltc'],
    'gioitinh': ['nam', 'nam', 'nữ']
})
df1

  hoten gioitinh
0   nva      nam
1   nvb      nam
2   ltc       nữ

In [3]:
df2 = pd.DataFrame({
    'hoten': ['ltd', 'nve'],
    'gioitinh': ['nam', 'nữ']
})
df2

  hoten gioitinh
0   ltd      nam
1   nve       nữ

In [4]:
# kết hợp df1 và df2 theo cột (thêm dòng)
#axis=0 là thêm zô dòng (append)
df_new1 = pd.concat([df1, df2], axis=0, ignore_index=True)
df_new1

  hoten gioitinh
0   nva      nam
1   nvb      nam
2   ltc       nữ
3   ltd      nam
4   nve       nữ

# TH2

In [5]:
df1 = pd.DataFrame({
    'hoten': ['nva', 'nvb', 'ltc'],
    'gioitinh': ['nam', 'nam', 'nữ']
})
df1

  hoten gioitinh
0   nva      nam
1   nvb      nam
2   ltc       nữ

In [6]:
df2 = pd.DataFrame({
    'hoten': ['ltd', 'nve'],
    'gioitinh': ['nam', 'nữ'],
    'dienthoai': ['0903222444', '0908111222']
})
df2

  hoten gioitinh   dienthoai
0   ltd      nam  0903222444
1   nve       nữ  0908111222

In [8]:
# kết hợp df1 và df2 theo cột (thêm dòng)
# nếu số lượng cột ko giống nhau, các giá trị bị thiếu sẽ là null
df_new2 = pd.concat([df1, df2], axis=0, ignore_index=True)
df_new2

  hoten gioitinh   dienthoai
0   nva      nam         NaN
1   nvb      nam         NaN
2   ltc       nữ         NaN
3   ltd      nam  0903222444
4   nve       nữ  0908111222

# TH3

In [9]:
df1 = pd.DataFrame({
    'hoten': ['nva', 'nvb', 'ltc'],
    'gioitinh': ['nam', 'nam', 'nữ']
})
df1

  hoten gioitinh
0   nva      nam
1   nvb      nam
2   ltc       nữ

In [10]:
df2 = pd.DataFrame({
    'hoten': ['nva', 'nvb', 'ltc', 'lte'],
    'dienthoai': ['0903222111', np.nan, '0903333444', '0918111222']
})
df2

  hoten   dienthoai
0   nva  0903222111
1   nvb         NaN
2   ltc  0903333444
3   lte  0918111222

In [12]:
# kết hợp df1 và df2 theo dòng (thêm cột)
# merge lại á
df_new3 = pd.concat([df1, df2], axis=1)
df_new3

  hoten gioitinh hoten   dienthoai
0   nva      nam   nva  0903222111
1   nvb      nam   nvb         NaN
2   ltc       nữ   ltc  0903333444
3   NaN      NaN   lte  0918111222

# dùng Glob để ghép nhiều file lại

In [17]:
import glob as gb

In [20]:
# tạo chuỗi mẫu
file_pattern = 'data/ds*.csv'

In [21]:
# sử dụng hàm glob để lấy danh sách file theo mẫu
list_files = gb.glob(file_pattern)
list_files

['data\\dsnv_03.csv',
 'data\\dsnv_1.csv',
 'data\\ds_nv_2.csv',
 'data\\ds_tong_1.csv']

In [22]:
# khai báo list chứa các DataFrame
list_data = []
#duyệt qua từng tên file trong list_files để đọc dữ liệu
for filename in list_files:
    #đọc dữ liệu
    df_temp = pd.read_csv(filename)
    #gắn dataframe vào list_data
    list_data.append(df_temp)

In [23]:
# nối các DataFrame trong list_data
df_all = pd.concat(list_data, ignore_index = True)
df_all

  hoten gioitinh  tuoi
0   ltd       nu    29
1   nva      nam    25
2   ltb       nu    22
3   nvc      nam    28
4   nva      nam    25
5   ltb       nu    22
6   nvc      nam    28
7   ltd       nu    29